# Загрузка данных

In [ ]:
# Импортируем в свой скрипт библиотеку Pandas
import pandas as pd

In [ ]:
# Загружаем данные в Python c помощью бибилиотеки Pandas
df = pd.read_csv('advertising.csv')

In [ ]:
# У метода read есть доп. параметры, которые можно указывать в скобках: 
df = pd.read_csv('advertising.csv', header = 0, sep = ',')

In [ ]:
# Возвратим первые 5 строк загруженного датафрейма
df.head()

   Daily Time Spent on Site  Age  ...            Timestamp  Clicked on Ad
0                     68.95   35  ...  2016-03-27 00:53:11              0
1                     80.23   31  ...  2016-04-04 01:39:02              0
2                     69.47   26  ...  2016-03-13 20:35:42              0
3                     74.15   29  ...  2016-01-10 02:31:19              0
4                     68.37   35  ...  2016-06-03 03:36:18              0

[5 rows x 10 columns]

In [ ]:
# Возвратим последние 5 строк загруженного датафрейма
df.tail()

     Daily Time Spent on Site  Age  ...            Timestamp  Clicked on Ad
995                     72.97   30  ...  2016-02-11 21:49:00              1
996                     51.30   45  ...  2016-04-22 02:07:01              1
997                     51.63   51  ...  2016-02-01 17:24:57              1
998                     55.55   19  ...  2016-03-24 02:35:54              0
999                     45.01   26  ...  2016-06-03 21:43:21              1

[5 rows x 10 columns]

# Статистика датасета

In [ ]:
# Посмотрим количество строк в датафрейме
len(df)

1000

In [ ]:
# Посмотрим количество строк и столбцов в датафрейме
df.shape

(1000, 10)

In [ ]:
# Общая статистика датасета
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 10 columns):
 #   Column                    Non-Null Count  Dtype
---  ------                    --------------  -----
 0   Daily Time Spent on Site  1000 non-null   float64
 1   Age                       1000 non-null   int64
 2   Area Income               1000 non-null   float64
 3   Daily Internet Usage      1000 non-null   float64
 4   Ad Topic Line             1000 non-null   object
 5   City                      1000 non-null   object
 6   Male                      1000 non-null   int64
 7   Country                   1000 non-null   object
 8   Timestamp                 1000 non-null   object
 9   Clicked on Ad             1000 non-null   int64
dtypes: float64(3), int64(3), object(4)
memory usage: 78.2+ KB

In [ ]:
# Описательная статистика для числовых столбцов датасета
df.describe()

       Daily Time Spent on Site          Age  ...         Male  Clicked on Ad
count               1000.000000  1000.000000  ...  1000.000000     1000.00000
mean                  65.000200    36.009000  ...     0.481000        0.50000
std                   15.853615     8.785562  ...     0.499889        0.50025
min                   32.600000    19.000000  ...     0.000000        0.00000
25%                   51.360000    29.000000  ...     0.000000        0.00000
50%                   68.215000    35.000000  ...     0.000000        0.50000
75%                   78.547500    42.000000  ...     1.000000        1.00000
max                   91.430000    61.000000  ...     1.000000        1.00000

[8 rows x 6 columns]

In [ ]:
# Описательная статистика для нечисловых столбцов датасета
df.describe(include=['object', 'bool'])

                                Ad Topic Line  ...            Timestamp
count                                    1000  ...                 1000
unique                                   1000  ...                 1000
top     Vision-oriented multi-tasking success  ...  2016-06-05 07:54:30
freq                                        1  ...                    1

[4 rows x 4 columns]

In [ ]:
# Подсчет встречаемости категорий в частотах
df['Clicked on Ad'].value_counts()

1    500
0    500
Name: Clicked on Ad, dtype: int64

In [ ]:
# Подсчет встречаемости категорий в долях
df['Country'].value_counts(normalize = True).head()

Czech Republic    0.009
France            0.009
Australia         0.008
Afghanistan       0.008
Cyprus            0.008
Name: Country, dtype: float64

In [ ]:
# Подсчет числа уникальных значений столбца
df['City'].nunique()

969

In [ ]:
# Вывод на экран всех уникальных значений столбца
df['City'].unique()[:10]

array(['Wrightburgh', 'West Jodi', 'Davidton', 'West Terrifurt',
       'South Manuel', 'Jamieberg', 'Brandonstad', 'Port Jefferybury',
       'West Colin', 'Ramirezton'], dtype=object)

# Извлечение данных

In [ ]:
# Извлечение отдельного столбца
df['Daily Time Spent on Site']

0      68.95
1      80.23
2      69.47
3      74.15
4      68.37
       ...
995    72.97
996    51.30
997    51.63
998    55.55
999    45.01
Name: Daily Time Spent on Site, Length: 1000, dtype: float64

In [ ]:
# Другой способ (но лучше не прибегать к нему)
df.Age

0      35
1      31
2      26
3      29
4      35
       ..
995    30
996    45
997    51
998    19
999    26
Name: Age, Length: 1000, dtype: int64

In [ ]:
# Извлечение нескольких столбцов
df[['Country', 'City', 'Area Income']]

                    Country            City  Area Income
0                   Tunisia     Wrightburgh     61833.90
1                     Nauru       West Jodi     68441.85
2                San Marino        Davidton     59785.94
3                     Italy  West Terrifurt     54806.18
4                   Iceland    South Manuel     73889.99
..                      ...             ...          ...
995                 Lebanon       Duffystad     71384.57
996  Bosnia and Herzegovina     New Darlene     67782.17
997                Mongolia   South Jessica     42415.72
998               Guatemala     West Steven     41920.79
999                  Brazil     Ronniemouth     29875.80

[1000 rows x 3 columns]

In [ ]:
# Добавление новых столбцов
df['Site time share'] = df['Daily Time Spent on Site'] / df['Daily Internet Usage']
df['Site time share'].head()

0    0.269241
1    0.414048
2    0.293742
3    0.301558
4    0.303085
Name: Site time share, dtype: float64

In [ ]:
# Применение статистических методов к столбцам (группам столбцов), например, вычисление среднего:
df[['Daily Time Spent on Site', 'Daily Internet Usage', 'Age']].mean()

Daily Time Spent on Site     65.0002
Daily Internet Usage        180.0001
Age                          36.0090
dtype: float64

# Фильтрация данных

In [ ]:
# Фильтрация данных встроенными способами
filtered_age = df[df['Age'] > 35]
filtered_age.head()

    Daily Time Spent on Site  Age  ...  Clicked on Ad  Site time share
7                      66.00   48  ...              1         0.500911
10                     47.64   49  ...              1         0.390428
11                     83.07   37  ...              0         0.359813
12                     69.57   48  ...              1         0.615011
16                     55.39   37  ...              1         0.428019

[5 rows x 11 columns]

In [ ]:
# Фильтрация данных с использованием нескольких условий
filtered_age_country = df[(df['Age'] > 35) & (df['Country'] == 'Australia')]
filtered_age_country.head()

     Daily Time Spent on Site  Age  ...  Clicked on Ad  Site time share
7                       66.00   48  ...              1         0.500911
208                     59.51   58  ...              1         0.422566
470                     43.84   36  ...              1         0.261856
500                     51.56   46  ...              1         0.412976
552                     56.39   58  ...              1         0.365623

[5 rows x 11 columns]

In [ ]:
# Фильтрация данных с помощью метода .loc
df.loc[100:105,['Country', 'Area Income']]

            Country  Area Income
100  Western Sahara     31947.65
101          Serbia     51864.77
102        Maldives     59593.56
103  Czech Republic     48376.14
104        Guernsey     56884.74
105        Tanzania     67186.54

In [ ]:
# Фильтрация датасета по значению столбца с помощью метода .loc
df.loc[df['Clicked on Ad'] == 1]

     Daily Time Spent on Site  Age  ...  Clicked on Ad  Site time share
7                       66.00   48  ...              1         0.500911
10                      47.64   49  ...              1         0.390428
12                      69.57   48  ...              1         0.615011
14                      42.95   33  ...              1         0.299178
15                      63.45   23  ...              1         0.451152
..                        ...  ...  ...            ...              ...
994                     43.70   28  ...              1         0.252587
995                     72.97   30  ...              1         0.349842
996                     51.30   45  ...              1         0.381640
997                     51.63   51  ...              1         0.428927
999                     45.01   26  ...              1         0.252369

[500 rows x 11 columns]

In [ ]:
# Получение значений столбца для определенного фильтра
df.loc[df['Clicked on Ad'] == 1, 'Age']

7      48
10     49
12     48
14     33
15     23
       ..
994    28
995    30
996    45
997    51
999    26
Name: Age, Length: 500, dtype: int64

In [ ]:
# Фильтрация данных с помощью метода .iloc
df.iloc[:,[1, 6]]

     Age  Male
0     35     0
1     31     1
2     26     0
3     29     1
4     35     0
..   ...   ...
995   30     1
996   45     1
997   51     1
998   19     0
999   26     0

[1000 rows x 2 columns]

In [ ]:
# Фильтрация данных с помощью метода .filter
country_stats = df.filter(items = ['Country', 'Area Income'])
country_stats.head()

      Country  Area Income
0     Tunisia     61833.90
1       Nauru     68441.85
2  San Marino     59785.94
3       Italy     54806.18
4     Iceland     73889.99

In [ ]:
# Фильтрация строк с помощью метода .query
country_stats.query('`Area Income` > 50000').head()

      Country  Area Income
0     Tunisia     61833.90
1       Nauru     68441.85
2  San Marino     59785.94
3       Italy     54806.18
4     Iceland     73889.99

In [ ]:
# Фильтрация текстовых стобцов с помощью метода .contains
df[df['Country'].str.contains('ru', case = False)].head()

    Daily Time Spent on Site  Age  ...  Clicked on Ad  Site time share
1                      80.23   31  ...              0         0.414048
11                     83.07   37  ...              0         0.359813
19                     74.58   40  ...              1         0.550365
22                     41.49   52  ...              1         0.251714
30                     67.64   35  ...              0         0.253324

[5 rows x 11 columns]

In [ ]:
df[df['Country'].str.contains('ru|bo|ja', case = False)].tail()

     Daily Time Spent on Site  Age  ...  Clicked on Ad  Site time share
973                     80.87   28  ...              0         0.397787
974                     41.88   40  ...              1         0.332091
978                     71.40   30  ...              0         0.429319
983                     82.79   32  ...              0         0.352583
996                     51.30   45  ...              1         0.381640

[5 rows x 11 columns]

# Сортировка данных

In [ ]:
# Применим сортировку данных для составления рейтинга ТОП-5 пользователей по ср. тратам времени на Интернет
df.sort_values(by = 'Daily Internet Usage', ascending = False).head()

     Daily Time Spent on Site  Age  ...  Clicked on Ad  Site time share
247                     57.05   41  ...              1         0.211328
30                      67.64   35  ...              0         0.253324
848                     70.39   32  ...              0         0.269157
367                     77.07   40  ...              0         0.295265
617                     68.41   38  ...              0         0.263358

[5 rows x 11 columns]

# Небольшой челлендж

In [ ]:
# Задание 1: выясните, в какой группе пользователей среди "молодежи" (до 30 лет) или "пенсионеров" (больше 60 лет) больше доля кликов на рекламу сайта?

In [ ]:
# Решение:

print('В группе молодежи доля кликнувших на рекламу:', df['Clicked on Ad'].loc[df['Age'] > 60].mean() * 100, '%')
print('В группе пенсионеров доля кликнувших на рекламу:', df['Clicked on Ad'].loc[df['Age'] < 30].mean() * 100, '%')

В группе молодежи доля кликнувших на рекламу: 100.0 %
В группе пенсионеров доля кликнувших на рекламу: 24.62121212121212 %

In [ ]:
# Задание 2: определите, мужчины или женщины больше времени сидят в интернете?

In [ ]:
# Решение:

print('Мужчины проводят в интернете в среднем', round(df.query('Male == 1')['Daily Internet Usage'].mean(),1), 'минут в день')
print('Женщины проводят в интернете в среднем', round(df.query('Male == 0')['Daily Internet Usage'].mean(),1), 'минут в день')

Мужчины проводят в интернете в среднем 181.3 минут в день
Женщины проводят в интернете в среднем 178.8 минут в день

In [ ]:
# Задание №3: Определеите ТОП-15 стран по количеству пользоваталей на сайте.

In [ ]:
df['Country'].value_counts().head(15)

Czech Republic            9
France                    9
Australia                 8
Afghanistan               8
Cyprus                    8
Peru                      8
Liberia                   8
Micronesia                8
South Africa              8
Senegal                   8
Turkey                    8
Greece                    8
Bosnia and Herzegovina    7
Burundi                   7
Bahamas                   7
Name: Country, dtype: int64

# Объединение датафреймов

In [ ]:
# Предположим, что у нас в датасете есть еще один столбец user_id:
import numpy as np

df = pd.read_csv('advertising.csv')

df['User_id'] = pd.Series(range(1000,2000))

new_order = [10,0,1,2,3,4,5,6,7,8,9]
df = df[df.columns[new_order]]

df.head()

   User_id  Daily Time Spent on Site  ...            Timestamp  Clicked on Ad
0     1000                     68.95  ...  2016-03-27 00:53:11              0
1     1001                     80.23  ...  2016-04-04 01:39:02              0
2     1002                     69.47  ...  2016-03-13 20:35:42              0
3     1003                     74.15  ...  2016-01-10 02:31:19              0
4     1004                     68.37  ...  2016-06-03 03:36:18              0

[5 rows x 11 columns]

In [ ]:
# Разделим наш датасет на три разных датасета: сведения о действиях пользователя на сайте, личнные данные и макроэкономические данные
cols_1 = ['User_id', 'Daily Time Spent on Site', 'Ad Topic Line', 'Timestamp', 'Clicked on Ad']
df_site = df[cols_1]

print('Размер датасета df_site:', df_site.shape)
df_site.head()

Размер датасета df_site: (1000, 5)

   User_id  Daily Time Spent on Site  ...            Timestamp Clicked on Ad
0     1000                     68.95  ...  2016-03-27 00:53:11             0
1     1001                     80.23  ...  2016-04-04 01:39:02             0
2     1002                     69.47  ...  2016-03-13 20:35:42             0
3     1003                     74.15  ...  2016-01-10 02:31:19             0
4     1004                     68.37  ...  2016-06-03 03:36:18             0

[5 rows x 5 columns]

In [ ]:
cols_2 = ['User_id', 'Male', 'Age', 'Country', 'City', 'Daily Internet Usage']
df_personal = df[cols_2]

print('Размер датасета df_personal:', df_personal.shape)
df_personal.head()

Размер датасета df_personal: (1000, 6)

   User_id  Male  Age     Country            City  Daily Internet Usage
0     1000     0   35     Tunisia     Wrightburgh                256.09
1     1001     1   31       Nauru       West Jodi                193.77
2     1002     0   26  San Marino        Davidton                236.50
3     1003     1   29       Italy  West Terrifurt                245.89
4     1004     0   35     Iceland    South Manuel                225.58

In [ ]:
cols_3 = ['Country', 'City','Area Income']

df_macro = df[cols_3][:-50]

print('Размер датасета df_macro:', df_macro.shape)
df_macro.head()

Размер датасета df_macro: (950, 3)

      Country            City  Area Income
0     Tunisia     Wrightburgh     61833.90
1       Nauru       West Jodi     68441.85
2  San Marino        Davidton     59785.94
3       Italy  West Terrifurt     54806.18
4     Iceland    South Manuel     73889.99

In [ ]:
# Предположим, что мы получили эти три датасета из разных источников и теперь нам нужно их объединить

df_2 = pd.merge(df_site, df_personal, on = 'User_id', how = 'left')

print('Размер датасета df_2:', df_2.shape)
df_2.head()

Размер датасета df_2: (1000, 10)

   User_id  Daily Time Spent on Site  ...            City Daily Internet Usage
0     1000                     68.95  ...     Wrightburgh               256.09
1     1001                     80.23  ...       West Jodi               193.77
2     1002                     69.47  ...        Davidton               236.50
3     1003                     74.15  ...  West Terrifurt               245.89
4     1004                     68.37  ...    South Manuel               225.58

[5 rows x 10 columns]

In [ ]:
# Задание: объедините датасет df_2 с датасетом df_macro

In [ ]:
# Решение:

df_3 = df_2.merge(df_macro, left_on = ['Country', 'City'], right_on = ['Country', 'City'], how = 'left')

print('Размер датасета df_3:', df_3.shape)
df_3.head()

Размер датасета df_3: (1000, 11)

   User_id  Daily Time Spent on Site  ... Daily Internet Usage Area Income
0     1000                     68.95  ...               256.09    61833.90
1     1001                     80.23  ...               193.77    68441.85
2     1002                     69.47  ...               236.50    59785.94
3     1003                     74.15  ...               245.89    54806.18
4     1004                     68.37  ...               225.58    73889.99

[5 rows x 11 columns]

In [ ]:
# Т.к. в датасете macro было меньше данных (n = 950), то часть строк в новом датасете будут пустыми или NaN
df_3[df_3.isna() == True]
print('Частично пустых строк:', df_3.isna().sum())

Частично пустых строк: User_id                      0
Daily Time Spent on Site     0
Ad Topic Line                0
Timestamp                    0
Clicked on Ad                0
Male                         0
Age                          0
Country                      0
City                         0
Daily Internet Usage         0
Area Income                 50
dtype: int64

In [ ]:
# Посмотрим сколько бы строк было в объединенном датасете, если бы метод объединения был 'inner':

df_4 = df_2.merge(df_macro, on = ['Country', 'City'], how = 'inner')

print('Размер датасета df_4:', df_4.shape)
df_4.head()

Размер датасета df_4: (950, 11)

   User_id  Daily Time Spent on Site  ... Daily Internet Usage Area Income
0     1000                     68.95  ...               256.09    61833.90
1     1001                     80.23  ...               193.77    68441.85
2     1002                     69.47  ...               236.50    59785.94
3     1003                     74.15  ...               245.89    54806.18
4     1004                     68.37  ...               225.58    73889.99

[5 rows x 11 columns]

In [ ]:
# Посмотрим сколько бы строк было в объединенном датасете, если бы метод объединения был 'right':

df_5 = df_2.merge(df_macro, on = ['Country', 'City'], how = 'right')

print('Размер датасета df_5:', df_5.shape)
df_5.head()

Размер датасета df_5: (950, 11)

   User_id  Daily Time Spent on Site  ... Daily Internet Usage Area Income
0     1000                     68.95  ...               256.09    61833.90
1     1001                     80.23  ...               193.77    68441.85
2     1002                     69.47  ...               236.50    59785.94
3     1003                     74.15  ...               245.89    54806.18
4     1004                     68.37  ...               225.58    73889.99

[5 rows x 11 columns]

In [ ]:
# Объдинение датасетов методом join

df_6 = df_site.set_index('User_id')
df_7 = df_personal.set_index('User_id')

df_8 = df_6.join(df_7, how = 'inner')

print('Размер датасета df_8:', df_8.shape)
df_8.head()

Размер датасета df_8: (1000, 9)

         Daily Time Spent on Site  ... Daily Internet Usage
User_id                            ...
1000                        68.95  ...               256.09
1001                        80.23  ...               193.77
1002                        69.47  ...               236.50
1003                        74.15  ...               245.89
1004                        68.37  ...               225.58

[5 rows x 9 columns]